content-org/control-flow.org
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_SECTION: control-flow
#+HUGO_PAIRED_SHORTCODES: katex
#+OPTIONS: ^:{}
#+PROPERTY: header-args:jupyter-julia :session control-flow :exports both :eval no-export :async yes

* While Loops
:PROPERTIES:
:EXPORT_FILE_NAME: while-loops
:END:
** Basic Structure

A =while= block executes code /while/ a condition is true. In general, a =while= block looks like:

#+begin_src julia
# A
while condition
    # B
end
# C
#+end_src

The =A=, =B=, and =C= comments represent some code that might be there. Julia follows these steps when executing this code:

#+BEGIN_EXPORT hugo
{{< mermaid class="text-center" >}}
graph TD
    A --> while[check condition]
    while -- true --> B --> while
    while -- false ---> C
{{< /mermaid >}}
#+END_EXPORT

If the condition is always ~false~, the block will not execute:

#+begin_src jupyter-julia
while false
    println("won't print")
end
println("will print")
#+end_src

#+RESULTS:
: will print

If the condition is always ~true~, the block will execute forever (or until you interrupt the execution with =CTRL-c=).

#+begin_src julia
while true
    println("hi")
end
#+end_src

If the condition depends on a variable, the while loop can run some whole number of times:

#+begin_src jupyter-julia
x = 1
while x <= 5
    println(x)
    x += 1
end
println("done")
#+end_src

#+RESULTS:
: 1
: 2
: 3
: 4
: 5
: done

#+BEGIN_EXPORT hugo
{{< mermaid class="text-center" >}}
graph TD
    A[set x to 1] --> while["check if x ≤ 5"]
    while -- true --> B[print x] --> C[increase x's value by one] --> while
    while -- false ----> D["print #quot;done#quot;"]
{{< /mermaid >}}
#+END_EXPORT

This has the effect of printing the integers between =1= and =5=, then printing "done". Here's a similar example that counts down instead of up:

#+begin_src jupyter-julia
t = 3
while t > 0
    println(t)
    sleep(1)
    t -= 1
end
println("liftoff!")
#+end_src

** Exercises

*** Exercise 1

Without running it, determine the output of the following code:

#+name: while-exercise-1
#+begin_src julia
x = 1234

while x > 0
    print(x % 10)
    x = div(x, 10)
end

println()
#+end_src

